ka2_2024/src/Catalogs/ТрудовыеФункции/ТрудовыеФункции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТрудовыеФункции</name>
  <predefined>
    <items>
      <name>ДАВТ</name>
      <description>Договор авторского заказа</description>
    </items>
    <items>
      <name>ДАВТФЛНС</name>
      <description>Договор авторского заказа, страхование от несчастных случаев</description>
    </items>
    <items>
      <name>ДГПХ</name>
      <description>Договор ГПХ о выполнении работ (оказании услуг)</description>
    </items>
    <items>
      <name>ДГПХФЛНС</name>
      <description>Договор ГПХ о выполнении работ (оказании услуг), страхование от несчастных случаев</description>
    </items>
    <items>
      <name>ДОИП</name>
      <description>Договор об отчуждении исключительного права на произведения науки, литературы, искусства</description>
    </items>
    <items>
      <name>ИЗЛД</name>
      <description>Издательский лицензионный договор</description>
    </items>
    <items>
      <name>ЛДПИ</name>
      <description>Лицензионный договор о предоставлении права использования произведения науки, литературы, искусства</description>
    </items>
  </predefined>
  <attributes>
    <name>КодПрофессиональнойДеятельности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКЗ</name>
    <type>
      <types>CatalogRef.КлассификаторЗанятий</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКПДТРКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПДТРКЧ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПДТРКатегория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПДТРКодСтатистика</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКЗСтатистика</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ka2_2024/src/Catalogs/ТрудовыеФункции/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура НачальноеЗаполнение() Экспорт
	
	ЗагрузитьКлассификатор();
	
КонецПроцедуры

Процедура ЗагрузитьКлассификатор() Экспорт
	
	ИменаПредопределенныхДанных = "ДГПХ,ДАВТ,ДОИП,ИЗЛД,ЛДПИ,ДГПХФЛНС,ДАВТФЛНС";
	НаименованияЭлементов = НаименованияПредопределенныхЭлементов();
	
	Для Каждого ИмяДанных Из СтрРазделить(ИменаПредопределенныхДанных, ",") Цикл
		
		Попытка
			СсылкаСправочника = ПредопределенноеЗначение("Справочник.ТрудовыеФункции." + ИмяДанных);
			ОбъектСправочника = СсылкаСправочника.ПолучитьОбъект();
		Исключение
			ОбъектСправочника = Справочники.ТрудовыеФункции.СоздатьЭлемент();
			ОбъектСправочника.ИмяПредопределенныхДанных = ИмяДанных;
		КонецПопытки;
		
		ОбъектСправочника.КодПрофессиональнойДеятельности = ИмяДанных;
		ОбъектСправочника.Наименование = НаименованияЭлементов.Получить(ИмяДанных);
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектСправочника);
		
	КонецЦикла;
	
КонецПроцедуры

Функция НаименованияПредопределенныхЭлементов()
	
	НаименованияЭлементов = Новый Соответствие;
	НаименованияЭлементов.Вставить("ДГПХ", НСтр("ru = 'Договор (работы, услуги)'"));
	НаименованияЭлементов.Вставить("ДАВТ", НСтр("ru = 'Договор авторского заказа'"));
	НаименованияЭлементов.Вставить("ДОИП", НСтр("ru = 'Договор об отчуждении исключительного права на произведения науки, литературы, искусства'"));
	НаименованияЭлементов.Вставить("ИЗЛД", НСтр("ru = 'Издательский лицензионный договор'"));
	НаименованияЭлементов.Вставить("ЛДПИ", НСтр("ru = 'Лицензионный договор о предоставлении права использования произведения науки, литературы, искусства,'"));
	НаименованияЭлементов.Вставить("ДГПХФЛНС", НСтр("ru = 'Договор (работы, услуги), страхование от несчастных случаев'"));
	НаименованияЭлементов.Вставить("ДАВТФЛНС", НСтр("ru = 'Договор авторского заказа, страхование от несчастных случаев'"));
	
	Возврат НаименованияЭлементов;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
